Repository: etruel/edd-pending-notifications
Catalog: lang/edd-pending-notification-*.po
Languages: es_es

source: Edd Pending Email Template
es_es: Plantilla de Emails Pendientes

source: Title
es_es: Titulo

source: Allowed labels
es_es: Etiquetas Traducidas

source: Save
es_es: Guardar

source: Remember by email
es_es: Recordar por Correo Electronico

source: Send Email
es_es: Enviando Correo

source: Message sent succesfully
es_es: Mensaje enviado con Ã©xito

source: This plugin
es_es: Este plugin

source: Requires Easy Digital Downloads!
es_es: Requiere del plugin Easy Digital Downloads!

source: activate it
es_es: activarlo
